{
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    18,
    2
  ],
  "drop_path_rate": 0.1,
  "dtype": "float32",
  "embed_dim": 192,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1536,
  "id2label": {
    "0": "1. Enfeksiyonel",
    "1": "2. Ekzama",
    "2": "3. Akne",
    "3": "4. Pigment",
    "4": "5. Benign",
    "5": "6. Malign"
  },
  "image_size": 384,
  "initializer_range": 0.02,
  "label2id": {
    "1. Enfeksiyonel": 0,
    "2. Ekzama": 1,
    "3. Akne": 2,
    "4. Pigment": 3,
    "5. Benign": 4,
    "6. Malign": 5
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    6,
    12,
    24,
    48
  ],
  "num_layers": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "path_norm": true,
  "qkv_bias": true,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "transformers_version": "4.57.1",
  "use_absolute_embeddings": false,
  "window_size": 12
}
